;============================================
; AMMO UPGRADES - BASIC
;============================================

[TLMUpgrade_MZFrostRounds X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="Bitterfrost Rounds"
FriendlyNamePlural="Bitterfrost Rounds"
BriefSummary="These rounds deliver a cryogenic vapour on impact that impairs mobility, and with sufficent application freezes enemies solid."
TinySummary="Frost Damage, -Clipsize"

[TLMUpgrade_RadRounds X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="Radiation Rounds"
FriendlyNamePlural="Radiation Rounds"
BriefSummary="Irradiated rounds capable of inflicting radiation effects on targets"
TinySummary="Radiation, -Clipsize"

[TLMUpgrade_HallucinogenicRounds X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="Terror Rounds"
FriendlyNamePlural="Terror Rounds"
BriefSummary="This round carries a supremely powerful chemical derived from the toxins used by Exalted Pathfinder Hunters that will undoubtedly cause a sense of terror, dread and panic on anyone hit by it."
TinySummary="+Damage, Panic, -Clipsize"

[TLMUpgrade_MZScrambleRounds X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="Scramble Rounds"
FriendlyNamePlural="Scramble Rounds"
BriefSummary="Scramble Rounds deploy a short range disruptive field on impact, impairing alien accuracy."
TinySummary="-enemy aim, -Clip size"

[TLMUpgrade_MZShredderRounds X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="Shredder Rounds"
FriendlyNamePlural="Shredder Rounds"
BriefSummary="Specialty rounds made to break down ADVENT armour, allowing future attacks to do more damage."
TinySummary="shred armour, -Clip size"

[TLMUpgrade_MZVampireRounds X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="Vampire Rounds"
FriendlyNamePlural="Vampire Rounds"
BriefSummary="Nanomachines in these high tech rounds harvest life from it's victims to heal the shooter."
TinySummary="heal shooter, acid damage, -Clip size"
;============================================
; AMMO UPGRADES - ADVANCED
;============================================

[TLMUpgrade_MZFrostRoundsAdv X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="Advanced Bitterfrost Rounds"
FriendlyNamePlural="Advanced Bitterfrost Rounds"
BriefSummary="These rounds deliver a cryogenic vapour on impact that impairs mobility, and with sufficent application freezes enemies solid."
TinySummary="Frost Damage"

[TLMUpgrade_RadRoundsAdv X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="Advanced Radiation Rounds"
FriendlyNamePlural="Advanced Radiation Rounds"
BriefSummary="Irradiated rounds capable of inflicting radiation effects on targets"
TinySummary="Radiation"

[TLMUpgrade_HallucinogenicRoundsAdv X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="Advanced Terror Rounds"
FriendlyNamePlural="Advanced Terror Rounds"
BriefSummary="This round carries a supremely powerful chemical derived from the toxins used by Exalted Pathfinder Hunters that will undoubtedly cause a sense of terror, dread and panic on anyone hit by it."
TinySummary="+Damage, Panic"

[TLMUpgrade_MZScrambleRoundsAdv X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="Advanced Scramble Rounds"
FriendlyNamePlural="Advanced Scramble Rounds"
BriefSummary="Scramble Rounds deploy a short range disruptive field on impact, impairing alien accuracy."
TinySummary="-enemy aim"

[TLMUpgrade_MZShredderRoundsAdv X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="Advanced Shredder Rounds"
FriendlyNamePlural="Advanced Shredder Rounds"
BriefSummary="Specialty rounds made to break down ADVENT armour, allowing future attacks to do more damage."
TinySummary="shred armour"

[TLMUpgrade_MZVampireRoundsAdv X2WeaponUpgradeTemplate_TLMAmmo]
FriendlyName="Advanced Vampire Rounds"
FriendlyNamePlural="Advanced Vampire Rounds"
BriefSummary="Nanomachines in these high tech rounds harvest life from it's victims to heal the shooter."
TinySummary="heal shooter, acid damage"


[X2DownloadableContentInfo_TeslaLootMod]

+RandomWeaponNickNames[199]="Dark Seal"
+RandomWeaponNickNames[200]="Divine Sunderer"
+RandomWeaponNickNames[201]="Everfrost"
+RandomWeaponNickNames[202]="Galeforce"
+RandomWeaponNickNames[203]="Goredrinker"
+RandomWeaponNickNames[204]="Celestial Mandate"
+RandomWeaponNickNames[205]="Day Harvester"
+RandomWeaponNickNames[206]="Stalker's Claw"
+RandomWeaponNickNames[207]="Riftseeker"
+RandomWeaponNickNames[208]="Stridebreaker"

